------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\SCIENCE\Documents\stata13\Multicollinearity.log
  log type:  text
 opened on:  29 Feb 2024, 22:41:55

. import delimited C:\Users\SCIENCE\Documents\cross.csv
(6 vars, 90 obs)
. gen date=t

. tsset c
        time variable:  c, 68978 to 4748320, but with gaps
                delta:  1 unit

. correlate i c q pf lf
(obs=90)

             |        i        c        q       pf       lf
-------------+---------------------------------------------
           i |   1.0000
           c |  -0.7086   1.0000
           q |  -0.8679   0.9263   1.0000
          pf |   0.0133   0.4790   0.2276   1.0000
          lf |  -0.3400   0.4143   0.4248   0.4867   1.0000


. regress c

      Source |       SS       df       MS              Number of obs =      90
-------------+------------------------------           F(  0,    89) =    0.00
       Model |           0     0           .           Prob > F      =       .
    Residual |  1.2647e+14    89  1.4210e+12           R-squared     =  0.0000
-------------+------------------------------           Adj R-squared =  0.0000
       Total |  1.2647e+14    89  1.4210e+12           Root MSE      =  1.2e+06

------------------------------------------------------------------------------
           c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |    1122524   125655.7     8.93   0.000     872848.6     1372199
------------------------------------------------------------------------------

. regress c i q pf lf

      Source |       SS       df       MS              Number of obs =      90
-------------+------------------------------           F(  4,    85) =  404.43
       Model |  1.2016e+14     4  3.0040e+13           Prob > F      =  0.0000
    Residual |  6.3136e+12    85  7.4278e+10           R-squared     =  0.9501
-------------+------------------------------           Adj R-squared =  0.9477
       Total |  1.2647e+14    89  1.4210e+12           Root MSE      =  2.7e+05

------------------------------------------------------------------------------
           c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           i |   99313.97   38122.27     2.61   0.011     23516.68    175111.3
           q |    2310417   124454.6    18.56   0.000      2062968     2557866
          pf |   1.091516   .1127786     9.68   0.000     .8672822     1.31575
          lf |   -2781588     682789    -4.07   0.000     -4139155    -1424021
       _cons |   559879.5   417900.3     1.34   0.184    -271018.3     1390777
------------------------------------------------------------------------------

. estat vif, uncentered

    Variable |       VIF       1/VIF  
-------------+----------------------
   intercept |    211.61    0.004726
          lf |    178.99    0.005587
           i |     26.71    0.037443
           q |     10.86    0.092096
          pf |      5.08    0.196719
-------------+----------------------
    Mean VIF |     86.65

. pca i c q pf lf

Principal components/correlation                  Number of obs    =        90
                                                  Number of comp.  =         5
                                                  Trace            =         5
    Rotation: (unrotated = principal)             Rho              =    1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      3.06551      1.85748             0.6131       0.6131
           Comp2 |      1.20803      .639407             0.2416       0.8547
           Comp3 |      .568624       .43189             0.1137       0.9684
           Comp4 |      .136733      .115636             0.0273       0.9958
           Comp5 |     .0210976            .             0.0042       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    ------------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5 | Unexplained 
    -------------+--------------------------------------------------+-------------
               i |  -0.4688    0.4426    0.1738    0.7238    0.1735 |           0 
               c |   0.5370   -0.0261    0.3814    0.4215   -0.6227 |           0 
               q |   0.5409   -0.2477    0.0941    0.3021    0.7389 |           0 
              pf |   0.2657    0.7377    0.4221   -0.4215    0.1714 |           0 
              lf |   0.3587    0.4448   -0.7983    0.1717   -0.0820 |           0 
    ------------------------------------------------------------------------------

. rotate

Principal components/correlation                  Number of obs    =        90
                                                  Number of comp.  =         5
                                                  Trace            =         5
    Rotation: orthogonal varimax (Kaiser off)     Rho              =    1.0000

    --------------------------------------------------------------------------
       Component |     Variance   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |            1  1.26944e-07             0.2000       0.2000
           Comp2 |            1  3.62493e-07             0.2000       0.4000
           Comp3 |            1  1.13679e-06             0.2000       0.6000
           Comp4 |            1   .000011152             0.2000       0.8000
           Comp5 |       .99999            .             0.2000       1.0000
    --------------------------------------------------------------------------

Rotated components 

    ------------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5 | Unexplained 
    -------------+--------------------------------------------------+-------------
               i |  -0.0000    0.0000    1.0000    0.0000    0.0000 |           0 
               c |   0.0000    0.0000   -0.0000    0.0000    1.0000 |           0 
               q |   0.0000    1.0000   -0.0000    0.0000   -0.0000 |           0 
              pf |   1.0000   -0.0000    0.0000    0.0000   -0.0000 |           0 
              lf |  -0.0000   -0.0000   -0.0000    1.0000   -0.0000 |           0 
    ------------------------------------------------------------------------------

Component rotation matrix

    ----------------------------------------------------------------
                 |    Comp1     Comp2     Comp3     Comp4     Comp5 
    -------------+--------------------------------------------------
           Comp1 |   0.2657    0.5409   -0.4688    0.3587    0.5370 
           Comp2 |   0.7377   -0.2477    0.4426    0.4448   -0.0261 
           Comp3 |   0.4221    0.0941    0.1738   -0.7983    0.3814 
           Comp4 |  -0.4215    0.3021    0.7238    0.1717    0.4215 
           Comp5 |   0.1714    0.7389    0.1735   -0.0820   -0.6227 
    ----------------------------------------------------------------

. predict new
(score assumed)
(4 components skipped)

Scoring coefficients for orthogonal varimax rotation
    sum of squares(column-loading) = 1

    ----------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5 
    -------------+--------------------------------------------------
               i |  -0.0000    0.0000    1.0000    0.0000    0.0000 
               c |   0.0000    0.0000   -0.0000    0.0000    1.0000 
               q |   0.0000    1.0000   -0.0000    0.0000   -0.0000 
              pf |   1.0000   -0.0000    0.0000    0.0000   -0.0000 
              lf |  -0.0000   -0.0000   -0.0000    1.0000   -0.0000 
    ----------------------------------------------------------------

. regress c i q pf lf

      Source |       SS       df       MS              Number of obs =      90
-------------+------------------------------           F(  4,    85) =  404.43
       Model |  1.2016e+14     4  3.0040e+13           Prob > F      =  0.0000
    Residual |  6.3136e+12    85  7.4278e+10           R-squared     =  0.9501
-------------+------------------------------           Adj R-squared =  0.9477
       Total |  1.2647e+14    89  1.4210e+12           Root MSE      =  2.7e+05

------------------------------------------------------------------------------
           c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           i |   99313.97   38122.27     2.61   0.011     23516.68    175111.3
           q |    2310417   124454.6    18.56   0.000      2062968     2557866
          pf |   1.091516   .1127786     9.68   0.000     .8672822     1.31575
          lf |   -2781588     682789    -4.07   0.000     -4139155    -1424021
       _cons |   559879.5   417900.3     1.34   0.184    -271018.3     1390777
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  C:\Users\SCIENCE\Documents\stata13\Multicollinearity.log
  log type:  text
 closed on:  29 Feb 2024, 23:11:31
------------------------------------------------------------------------------------------------------------------------
